---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeDefinition
source: html/2feda891-4aee-9ca8-239e-e8285d98ffe7.htm
---
# RebarShapeDefinition Methods

Add a formula-driven parameter to the shape definition.